# FFillPat

## Description
Function FFillPat returns the current fill pattern setting.

Fill patterns and their associated constants can be found in the [[VS:Function Reference Appendix#Fill Patterns|VectorScript Appendix]].

```pascal
FUNCTION FFillPat : LONGINT;
```

```python
def vs.FFillPat():
    return LONGINT
```

## Examples
==== VectorScript ====
```pascal
currFillStyle:=FFillPat;
```
==== Python ====
```python
currFillStyle = vs.FFillPat()
```

## Version
Availability: from All Versions

## Category
* Document Attributes